<?php

namespace App\Http\Controllers\Api;

use App\Classes\SEO\SeoDummyTags;
use App\Http\Controllers\Controller;
use App\Http\Resources\ProductLite;
use App\Models\Product;
use App\Models\Websitesetting;
use App\Repositories\ProductRepository;
use App\Traits\MetaCommon;
use Illuminate\Http\Request;

class AbrishamDashboardPageController extends Controller
{
    use MetaCommon;

    private $setting;

    public function __construct(Websitesetting $setting)
    {
        $this->setting = $setting->setting;
    }

    public function oldDashboard(Request $request)
    {
        $url = $request->url();
        $this->generateSeoMetaTags(new SeoDummyTags('داشبورد راه ابریشم',
            'داشبودر راه ابریشم', $url,
            $url, route('image', [
                'category' => '11',
                'w' => '100',
                'h' => '100',
                'filename' => $this->setting->site->siteLogo,
            ]), '100', '100', null));


        $user = $request->user();
        $abrishamProducts = ProductLite::collection(ProductRepository::getProductsById(array_keys(Product::ALL_ABRISHAM_PRODUCTS))->get());
        $liveDescription = collect();
        foreach ($abrishamProducts as $abrishamProduct) {
            $liveDescription->push([
                'product_id' => $abrishamProduct->id,
                'live_descriptions' => $abrishamProduct->livedescriptions()->createdAfter('2022-07-09 00:00:00')->get()->sortByDesc('created_at')
            ]);
        }

        $faq = [
            [
                'title' => 'راه ابریشم ویژه دوازدهمیاست؟ یا فارغ‌التحصیل ها ام می‌توانند ثبت‌نام کنند؟',
                'body' => 'راه ابریشم، بهترین محتوا و مسیر مطالعاتی رو برای یک کنکوری، چه دوازدهمی و چه فارغ التحصیل فراهم کرده و شامل محتوای کاملیه که در قالب سه هفته مطالعاتی باید با اون پیش برید و با مسیری که به دقت ترسیم شده و با تلاشی که انجام میدید شما رو به نقطه مطلوبتون در کنکور میرسونه. بدون تردید کوتاهترین مسیر رو انتخاب کردی، و همسفرت آلاست و این بهترین سفر ما در کنار هم خواهد بود.
                <br>
پس چه دوازدهمی باشی و چه فارغ‌التحصیلی که حتی چند ساله از درس دور بوده؛ شک نکن در این مسیر تمام نیاز های آموزشی و مهارتی شمارو درنظر گرفتیم و اگر با خودت عهد کردی که بهترین نتیجه ممکن کسب کنی؛ قدم در راه ابریشم، بهترین تصمیمی است که می‌تونستی بگیری .'
            ],
            [
                'title' => 'دهمیا و یازدهمیا هم می‌توانند از این دوره استفاده کنند؟',
                'body' => ' برای عزیزانی که پایه دهم یا یازدهم هستند، استفاده از دوره های صفرتاصد و کارگاه نکته و تست (که هر دو رایگان در دسترس عموم دانش آموزان قرار داره) برای یادیگری عمیق و تسلط کفایت میکنه و در اولویت قرار داره.
<br>
اما اگه این دغدغه و یا اشتیاق رو داری که در یک مسیر حرفه ای، مباحثی از سال تحصیلی خودت که در کنکور مطرح میشه رو داشته باشی و با یه جهتگیری صد در صد کنکوری پیش بری و همچنین درسنامه مرتبی رو دیده و تست های کاملا هدفمندی رو تجربه کرده باشی، راه ابریشم پازلی خواهد بود که در طی یک یا دو سال پیش رو به تدریج روند ارتقای مهارت کنکوری شما رو تکمیل میکنه.'
            ],
            [
                'title' => 'میزان سطح آموزشی لازم و پیش نیاز های ثبت نام در راه ابریشم چیست؟',
                'body' => 'اصلا اهمیتی نداره که در ابتدای حرکت مسیر راه ابریشم؛
<br>
در چه سطحی هستیم یا چه ترازی داریم!!!
<br>
سال های گذشته درس خوندی یا نخوندی!!!
<br>
تو چه مدرسه ای بودی!!!
<br>
چه محدودیت هایی داشتی!!!
<br>
چون ابزار ها و امکاناتی که راه ابریشم در اختیارت قرار میده؛ همون ویژگی هایی رو داره که رتبه برترهای سال های گذشته همراه خودشون داشتن! منتها امسال آلاء همه رو یکجا جمع و یک مسیر کوتاه براش رسم کرده...
<br>
در قالب یک برنامه منعطف و حساب شده!
<br>
برای رشد تراز همه کنکوری ها در هر شرایطی!
<br>
پس برای شروع این سفر به هیچی لازم نداری جز یک چیز!! پاسخ این سوال!
<br>
آیا دوست داری برای رسیدن به هدفت تلاش کنی؟!چقدر؟!
'
            ],
            [
                'title' => ' اگر راه ابریشم داشته باشم؛ نیاز به منبع آموزشی دیگه‌ای هم دارم؟',
                'body' => 'وقتی داریم درباره ی یک مسیر صحبت میکنیم یا بهتره بگیم، یک برنامه هدفگذاری شده؛ کاملا واضح است که ابزار لازم رو در کنارش داریم! مگرنه مسیری که پر از چاله باشه، ما رو در این رقابت با زمان از هدفمون دور میکنه!!
<br>
هر فرسنگ راه ابریشم یک بخش یادگیری و ادراک داره به همراه حل مثال های مفهومی لابه لای تدریس مباحث تا همراه استاد با آمادگی ذهنی کامل بری سراغ تسلط روی تست ها!😉
<br>
تو سوال قبلی هم بهت گفتم! تو این مسیر لازم نیست هیچی با خودت برداری! همه چی آمادست .
آلاء فکر همه جاشو کرده و شما فقط با تمرکز کافی، تعهد به تلاش و از همه مهم‌تر، با خیالی راحت وارد مسیر شو!'
            ],
            [
                'title' => 'راه ابریشم بصورت پک فیزیکی ارسال میشه یا یک دوره آنلاینه؟',
                'body' => 'خوشبختانه راه ابریشم مسیریه که شما در هر نقطه جغرافیایی این کره خاکی که حضور داشته باشی؛ میتونی از همونجا سفرتو شروع کنی!
<br>
محتویات این برنامه ی هدفگذاری شده برای دسترسی راحت‌تر و سریع‌تر -با توجه به محدودیت های زمانی ای که یک داوطلب کنکور داره- فقط در سایت آلاء، به صورت مجازی و با ترتیبی که اعلام میشه هفته به هفته تو پروفایلتون منتشر خواهد شد و شما میتونین اون رو دانلود کنین...
<br>
یعنی دسترسی به این برنامه فقط با چند تا کلیک ساده اتفاق میفته و لازم نیست برای حضور در مکانی خاص انرژی صرف بشه...
<br>
یک مزیت دیگه این هست که اگر در مبحثی تمرکز کافی رو به کار نگرفتین، میتونین مجدد محتوای مربوط به اون مبحث رو تماشا کنین تا یادگیری‌تون فرایند کامل شدنش رو طی کنه ...'
            ],
            [
                'title' => 'برنامه راهبردی راه ابریشم آلاء، با برنامه آزمون های دوره‌ای ما مطابقت داره؟',
                'body' => 'برنامه راهبردی راه ابریشم آلاء، بسیار دقیق و منسجم تا روز کنکور چیده شده و تا رسیدن به هدفت یعنی موفقیت در آزمون سراسری میتونی بهش تکیه کنی .
<br>
بطور معمول تمام آزمون ها از منظر بودجه بندی، هم پوشانی بالایی دارند و شما در راه ابریشم نیز می‌توانید تا حدود زیادی به بودجه بندی آزمون های دوره‌ای خودتون هم برسید .
<br>
فرسنگ های راه ابریشم سه هفته‌ای است و مطابقت بالایی با آزمون گزینه دو خواهد داشت .
<br>
پیش آزمون و پس آزمون قلمچی و گزینه دو، از جذاب‌ترین اتفاقات راه ابریشم به حساب میاد .'
            ],
            [
                'title' => 'آیا آموزش آنلاین، جایگزین آموزش حضوری خواهد بود؟',
                'body' => 'امروزه، بلعکس این سوال صحیح است.
<br>
آموزش آنلاین ویژگی ها و قابلیت هایی رو خواهد داشت که اجرایی شدن این‌ها در شیوه حضوری حتی امکان‌پذیر نیست یا بسیار گران و دشوار است .
<br>
آموزش آنلاین به خودی خود هیجان‌انگیز است خصوصا اگر زیرنظر آلاء باشه .
<br>
این رو آلایی ها نازنین به خوبی درک میکنند .'
            ],
            [
                'title' => ' درمورد برنامه هدفمند راه ابریشم بیشتر توضیح میدید؟ ',
                'body' => 'این نکته حائز اهمیت است ...
<br>
راه ابریشم، مسیری است که آلاء طراحی کرده تا شما رو از مبدا (وضعیت فعلی) به مقصد (هدف شما) برسونه!
 و قبلا هم صحبت کردیم که چنین مسیری حتما باید یک نقشه داشته باشه تا در نهایت راحت و بدون دردسر و بدون هدر دادن زمان به مقصدمون برسیم...
 <br>
 پس چیزی که در این راه خیلی مهمه و آلاء هم روی اون تاکید داره؛ این هست که مطابق این نقشه که مدت ها برای طراحی‌اش تحقیق و آزمایش انجام شده، گام به گام مسیر رو طی کنیم .
 <br>
 در بازه های سه هفته‌ای راه ابریشم (فرسنگ) با مراحل ادراک، تثبیت، تسلط، ارزیابی و جمع‌بندی کنار هم هستیم تا دغدغه اصلی هممون در بازه های زمانی مختلف سال، مشترک باشه و خیلی زود خودمون رو به اون سطحی که باید باشیم برسونیم .'
            ],
            [
                'title' => 'تا چه زمانی می‌تونم از فیلم ها و جزوات دوره استفاده کنم؟ محدودیتی دارم؟',
                'body' => ' نگران نباش چون، هر زمان که ثبت نام کنی تا هرزمان که تمایل داشتی میتونی از محتوا و برنامه این دوره استفاده کنی . یه منبع آموزشی همیشه در دسترس.
<br>
این دوره برای استفاده شخص شما طراحی شده و استفاده اشتراکی با سایر دوستان به هیچ عنوان صحیح نیست و آلاء رضایت ندارد .'
            ],
            [
                'title' => 'استفاده اشتراکی با سایر دوستان از این دوره صحیح است؟ آلاء رضایت داره؟',
                'body' => ' تمام منافع مادی دوره های غیررایگان آلاء تماما صرف نگه‌داری هزاران ساعت محتوای رایگان آلاء، توسعه هرچه بیشتر امکانات رایگان و  هزینه های بسیار بالای مجموعه آلاء خواهد شد؛ درنتیجه اشتراکی خرید کردن، دریافت رایگان محتوای غیررایگان آلاء از سایر کانال ها و هرنوع استفاده غیرقانونی از این محصولات شرعا، قانونا و اخلاقا صحیح نیست و مجموعه آلاء به هیچ عنوان رضایت نخواهد داشت .'
            ],
            [
                'title' => 'انتشار یا دریافت این محصول چگونه است؟',
                'body' => 'این محصول به تدریج و در بازه های 3 هفته ای منتشر می شود'
            ],
        ];

        $banners = [
//            [
//                'url' => 'https://alaatv.com/',
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'url' => false,
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ]
        ];

        $APIAddresses = [
            'studyEventStudyPlan' => '/api/v2/studyEvent/8/studyPlans',
            'liveDescription' => '/api/v2/livedescription?created_at_since=2022-07-09&order_by[]=created_at&order_type[]=desc',
            'pinnedLiveDescription' => '/api/v2/livedescription/getPined',
            'seenLiveDescription' => '/api/v2/livedescription',
            'consultingContents' => '/api/v2/set/1213/contents',
            'whereIsKarvan' => '/api/v2/abrisham/whereIsKarvan?studyevent=8',
            'abrishamLessons' => '/api/v2/abrisham/lessons',
            'abrishamMajors' => '/api/v2/abrisham/majors',
        ];

        $logoImages = [
            'appbar' => 'https://nodes.alaatv.com/upload/abrisham-panel-logotype.png',
            'sidebar' => 'https://nodes.alaatv.com/upload/abrisham-panel-logo.png'
        ];
        return response()->json([
            'user' => $user,
            'abrishamProducts' => $abrishamProducts,
            'liveDescription' => $liveDescription,
            'faq' => $faq,
            'banners' => $banners,
            'APIAddresses' => $APIAddresses,
            'logoImages' => $logoImages,

        ], 200);
    }

    public function proDashboard(Request $request)
    {
        $url = $request->url();
        $this->generateSeoMetaTags(new SeoDummyTags('داشبورد راه ابریشم پرو',
            'داشبودر راه ابریشم پرو', $url,
            $url, route('image', [
                'category' => '11',
                'w' => '100',
                'h' => '100',
                'filename' => $this->setting->site->siteLogo,
            ]), '100', '100', null));


        $user = $request->user();
        $abrishamProducts =
            ProductLite::collection(ProductRepository::getProductsById(array_keys(Product::ALL_ABRISHAM_PRO_PRODUCTS))->get());
        $liveDescription = collect();
        foreach ($abrishamProducts as $abrishamProduct) {
            $liveDescription->push([
                'product_id' => $abrishamProduct->id,
                'live_descriptions' => $abrishamProduct->livedescriptions->sortByDesc('created_at')
            ]);
        }

        $faq = [
            [
                'title' => 'راه ابریشم ویژه دوازدهمیاست؟ یا فارغ‌التحصیل ها ام می‌توانند ثبت‌نام کنند؟',
                'body' => 'راه ابریشم، بهترین محتوا و مسیر مطالعاتی رو برای یک کنکوری، چه دوازدهمی و چه فارغ التحصیل فراهم کرده و شامل محتوای کاملیه که در قالب سه هفته مطالعاتی باید با اون پیش برید و با مسیری که به دقت ترسیم شده و با تلاشی که انجام میدید شما رو به نقطه مطلوبتون در کنکور میرسونه. بدون تردید کوتاهترین مسیر رو انتخاب کردی، و همسفرت آلاست و این بهترین سفر ما در کنار هم خواهد بود.
                <br>
پس چه دوازدهمی باشی و چه فارغ‌التحصیلی که حتی چند ساله از درس دور بوده؛ شک نکن در این مسیر تمام نیاز های آموزشی و مهارتی شمارو درنظر گرفتیم و اگر با خودت عهد کردی که بهترین نتیجه ممکن کسب کنی؛ قدم در راه ابریشم، بهترین تصمیمی است که می‌تونستی بگیری .',
            ],
            [
                'title' => 'دهمیا و یازدهمیا هم می‌توانند از این دوره استفاده کنند؟',
                'body' => ' برای عزیزانی که پایه دهم یا یازدهم هستند، استفاده از دوره های صفرتاصد و کارگاه نکته و تست (که هر دو رایگان در دسترس عموم دانش آموزان قرار داره) برای یادیگری عمیق و تسلط کفایت میکنه و در اولویت قرار داره.
<br>
اما اگه این دغدغه و یا اشتیاق رو داری که در یک مسیر حرفه ای، مباحثی از سال تحصیلی خودت که در کنکور مطرح میشه رو داشته باشی و با یه جهتگیری صد در صد کنکوری پیش بری و همچنین درسنامه مرتبی رو دیده و تست های کاملا هدفمندی رو تجربه کرده باشی، راه ابریشم پازلی خواهد بود که در طی یک یا دو سال پیش رو به تدریج روند ارتقای مهارت کنکوری شما رو تکمیل میکنه.',
            ],
            [
                'title' => 'میزان سطح آموزشی لازم و پیش نیاز های ثبت نام در راه ابریشم چیست؟',
                'body' => 'اصلا اهمیتی نداره که در ابتدای حرکت مسیر راه ابریشم؛
<br>
در چه سطحی هستیم یا چه ترازی داریم!!!
<br>
سال های گذشته درس خوندی یا نخوندی!!!
<br>
تو چه مدرسه ای بودی!!!
<br>
چه محدودیت هایی داشتی!!!
<br>
چون ابزار ها و امکاناتی که راه ابریشم در اختیارت قرار میده؛ همون ویژگی هایی رو داره که رتبه برترهای سال های گذشته همراه خودشون داشتن! منتها امسال آلاء همه رو یکجا جمع و یک مسیر کوتاه براش رسم کرده...
<br>
در قالب یک برنامه منعطف و حساب شده!
<br>
برای رشد تراز همه کنکوری ها در هر شرایطی!
<br>
پس برای شروع این سفر به هیچی لازم نداری جز یک چیز!! پاسخ این سوال!
<br>
آیا دوست داری برای رسیدن به هدفت تلاش کنی؟!چقدر؟!
',
            ],
            [
                'title' => ' اگر راه ابریشم داشته باشم؛ نیاز به منبع آموزشی دیگه‌ای هم دارم؟',
                'body' => 'وقتی داریم درباره ی یک مسیر صحبت میکنیم یا بهتره بگیم، یک برنامه هدفگذاری شده؛ کاملا واضح است که ابزار لازم رو در کنارش داریم! مگرنه مسیری که پر از چاله باشه، ما رو در این رقابت با زمان از هدفمون دور میکنه!!
<br>
هر فرسنگ راه ابریشم یک بخش یادگیری و ادراک داره به همراه حل مثال های مفهومی لابه لای تدریس مباحث تا همراه استاد با آمادگی ذهنی کامل بری سراغ تسلط روی تست ها!😉
<br>
تو سوال قبلی هم بهت گفتم! تو این مسیر لازم نیست هیچی با خودت برداری! همه چی آمادست .
آلاء فکر همه جاشو کرده و شما فقط با تمرکز کافی، تعهد به تلاش و از همه مهم‌تر، با خیالی راحت وارد مسیر شو!',
            ],
            [
                'title' => 'راه ابریشم بصورت پک فیزیکی ارسال میشه یا یک دوره آنلاینه؟',
                'body' => 'خوشبختانه راه ابریشم مسیریه که شما در هر نقطه جغرافیایی این کره خاکی که حضور داشته باشی؛ میتونی از همونجا سفرتو شروع کنی!
<br>
محتویات این برنامه ی هدفگذاری شده برای دسترسی راحت‌تر و سریع‌تر -با توجه به محدودیت های زمانی ای که یک داوطلب کنکور داره- فقط در سایت آلاء، به صورت مجازی و با ترتیبی که اعلام میشه هفته به هفته تو پروفایلتون منتشر خواهد شد و شما میتونین اون رو دانلود کنین...
<br>
یعنی دسترسی به این برنامه فقط با چند تا کلیک ساده اتفاق میفته و لازم نیست برای حضور در مکانی خاص انرژی صرف بشه...
<br>
یک مزیت دیگه این هست که اگر در مبحثی تمرکز کافی رو به کار نگرفتین، میتونین مجدد محتوای مربوط به اون مبحث رو تماشا کنین تا یادگیری‌تون فرایند کامل شدنش رو طی کنه ...',
            ],
            [
                'title' => 'برنامه راهبردی راه ابریشم آلاء، با برنامه آزمون های دوره‌ای ما مطابقت داره؟',
                'body' => 'برنامه راهبردی راه ابریشم آلاء، بسیار دقیق و منسجم تا روز کنکور چیده شده و تا رسیدن به هدفت یعنی موفقیت در آزمون سراسری میتونی بهش تکیه کنی .
<br>
بطور معمول تمام آزمون ها از منظر بودجه بندی، هم پوشانی بالایی دارند و شما در راه ابریشم نیز می‌توانید تا حدود زیادی به بودجه بندی آزمون های دوره‌ای خودتون هم برسید .
<br>
فرسنگ های راه ابریشم سه هفته‌ای است و مطابقت بالایی با آزمون گزینه دو خواهد داشت .
<br>
پیش آزمون و پس آزمون قلمچی و گزینه دو، از جذاب‌ترین اتفاقات راه ابریشم به حساب میاد .',
            ],
            [
                'title' => 'آیا آموزش آنلاین، جایگزین آموزش حضوری خواهد بود؟',
                'body' => 'امروزه، بلعکس این سوال صحیح است.
<br>
آموزش آنلاین ویژگی ها و قابلیت هایی رو خواهد داشت که اجرایی شدن این‌ها در شیوه حضوری حتی امکان‌پذیر نیست یا بسیار گران و دشوار است .
<br>
آموزش آنلاین به خودی خود هیجان‌انگیز است خصوصا اگر زیرنظر آلاء باشه .
<br>
این رو آلایی ها نازنین به خوبی درک میکنند .',
            ],
            [
                'title' => ' درمورد برنامه هدفمند راه ابریشم بیشتر توضیح میدید؟ ',
                'body' => 'این نکته حائز اهمیت است ...
<br>
راه ابریشم، مسیری است که آلاء طراحی کرده تا شما رو از مبدا (وضعیت فعلی) به مقصد (هدف شما) برسونه!
 و قبلا هم صحبت کردیم که چنین مسیری حتما باید یک نقشه داشته باشه تا در نهایت راحت و بدون دردسر و بدون هدر دادن زمان به مقصدمون برسیم...
 <br>
 پس چیزی که در این راه خیلی مهمه و آلاء هم روی اون تاکید داره؛ این هست که مطابق این نقشه که مدت ها برای طراحی‌اش تحقیق و آزمایش انجام شده، گام به گام مسیر رو طی کنیم .
 <br>
 در بازه های سه هفته‌ای راه ابریشم (فرسنگ) با مراحل ادراک، تثبیت، تسلط، ارزیابی و جمع‌بندی کنار هم هستیم تا دغدغه اصلی هممون در بازه های زمانی مختلف سال، مشترک باشه و خیلی زود خودمون رو به اون سطحی که باید باشیم برسونیم .',
            ],
            [
                'title' => 'تا چه زمانی می‌تونم از فیلم ها و جزوات دوره استفاده کنم؟ محدودیتی دارم؟',
                'body' => ' نگران نباش چون، هر زمان که ثبت نام کنی تا هرزمان که تمایل داشتی میتونی از محتوا و برنامه این دوره استفاده کنی . یه منبع آموزشی همیشه در دسترس.
<br>
این دوره برای استفاده شخص شما طراحی شده و استفاده اشتراکی با سایر دوستان به هیچ عنوان صحیح نیست و آلاء رضایت ندارد .',
            ],
            [
                'title' => 'استفاده اشتراکی با سایر دوستان از این دوره صحیح است؟ آلاء رضایت داره؟',
                'body' => ' تمام منافع مادی دوره های غیررایگان آلاء تماما صرف نگه‌داری هزاران ساعت محتوای رایگان آلاء، توسعه هرچه بیشتر امکانات رایگان و  هزینه های بسیار بالای مجموعه آلاء خواهد شد؛ درنتیجه اشتراکی خرید کردن، دریافت رایگان محتوای غیررایگان آلاء از سایر کانال ها و هرنوع استفاده غیرقانونی از این محصولات شرعا، قانونا و اخلاقا صحیح نیست و مجموعه آلاء به هیچ عنوان رضایت نخواهد داشت .',
            ],
            [
                'title' => 'انتشار یا دریافت این محصول چگونه است؟',
                'body' => 'این محصول به تدریج و در بازه های 3 هفته ای منتشر می شود',
            ],
        ];

        $banners = [
//            [
//                'url' => 'https://alaatv.com/',
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'url' => false,
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ]
        ];

        $APIAddresses = [
            'studyEventStudyPlan' => '/api/v2/studyEvent/9/studyPlans',
            'liveDescription' => '/api/v2/livedescription?isPro=1&order_by[]=created_at&order_type[]=desc',
            'pinnedLiveDescription' => '/api/v2/livedescription/getPined',
            'seenLiveDescription' => '/api/v2/livedescription',
            'consultingContents' => '/api/v2/set/1597/contents',
            'whereIsKarvan' => '/api/v2/abrisham/whereIsKarvan?studyevent=9',
            'abrishamLessons' => '/api/v2/abrisham/lessons?isPro=1',
            'abrishamMajors' => '/api/v2/abrisham/majors',
        ];

        $logoImages = [
            'appbar' => 'https://nodes.alaatv.com/upload/abrisham-panel-logotype.png',
            'sidebar' => 'https://nodes.alaatv.com/upload/abrisham-panel-logo.png'
        ];

        return response()->json([
            'user' => $user,
            'abrishamProducts' => $abrishamProducts,
            'liveDescription' => $liveDescription,
            'faq' => $faq,
            'banners' => $banners,
            'APIAddresses' => $APIAddresses,
            'logoImages' => $logoImages
        ], 200);
    }

    public function chatreNejatDashboard(Request $request)
    {
        $url = $request->url();
        $this->generateSeoMetaTags(new SeoDummyTags('داشبورد چتر نجات',
            'داشبودر چتر نجات', $url,
            $url, route('image', [
                'category' => '11',
                'w' => '100',
                'h' => '100',
                'filename' => $this->setting->site->siteLogo,
            ]), '100', '100', null));

        $user = $request->user();


        $chatreNejatProducts =
            ProductLite::collection(ProductRepository::getProductsById(array_keys(Product::ALL_CHATR_NEJAT2_PRODUCTS))->get());
        $liveDescription = collect();
        foreach ($chatreNejatProducts as $product) {
            $liveDescription->push([
                'product_id' => $product->id,
                'live_descriptions' => $product->livedescriptions()->get()->sortByDesc('created_at')
            ]);
        }

        $faq = [
            [
                'title' => 'راه ابریشم ویژه دوازدهمیاست؟ یا فارغ‌التحصیل ها ام می‌توانند ثبت‌نام کنند؟',
                'body' => 'راه ابریشم، بهترین محتوا و مسیر مطالعاتی رو برای یک کنکوری، چه دوازدهمی و چه فارغ التحصیل فراهم کرده و شامل محتوای کاملیه که در قالب سه هفته مطالعاتی باید با اون پیش برید و با مسیری که به دقت ترسیم شده و با تلاشی که انجام میدید شما رو به نقطه مطلوبتون در کنکور میرسونه. بدون تردید کوتاهترین مسیر رو انتخاب کردی، و همسفرت آلاست و این بهترین سفر ما در کنار هم خواهد بود.
                <br>
پس چه دوازدهمی باشی و چه فارغ‌التحصیلی که حتی چند ساله از درس دور بوده؛ شک نکن در این مسیر تمام نیاز های آموزشی و مهارتی شمارو درنظر گرفتیم و اگر با خودت عهد کردی که بهترین نتیجه ممکن کسب کنی؛ قدم در راه ابریشم، بهترین تصمیمی است که می‌تونستی بگیری .',
            ],
            [
                'title' => 'دهمیا و یازدهمیا هم می‌توانند از این دوره استفاده کنند؟',
                'body' => ' برای عزیزانی که پایه دهم یا یازدهم هستند، استفاده از دوره های صفرتاصد و کارگاه نکته و تست (که هر دو رایگان در دسترس عموم دانش آموزان قرار داره) برای یادیگری عمیق و تسلط کفایت میکنه و در اولویت قرار داره.
<br>
اما اگه این دغدغه و یا اشتیاق رو داری که در یک مسیر حرفه ای، مباحثی از سال تحصیلی خودت که در کنکور مطرح میشه رو داشته باشی و با یه جهتگیری صد در صد کنکوری پیش بری و همچنین درسنامه مرتبی رو دیده و تست های کاملا هدفمندی رو تجربه کرده باشی، راه ابریشم پازلی خواهد بود که در طی یک یا دو سال پیش رو به تدریج روند ارتقای مهارت کنکوری شما رو تکمیل میکنه.',
            ],
            [
                'title' => 'میزان سطح آموزشی لازم و پیش نیاز های ثبت نام در راه ابریشم چیست؟',
                'body' => 'اصلا اهمیتی نداره که در ابتدای حرکت مسیر راه ابریشم؛
<br>
در چه سطحی هستیم یا چه ترازی داریم!!!
<br>
سال های گذشته درس خوندی یا نخوندی!!!
<br>
تو چه مدرسه ای بودی!!!
<br>
چه محدودیت هایی داشتی!!!
<br>
چون ابزار ها و امکاناتی که راه ابریشم در اختیارت قرار میده؛ همون ویژگی هایی رو داره که رتبه برترهای سال های گذشته همراه خودشون داشتن! منتها امسال آلاء همه رو یکجا جمع و یک مسیر کوتاه براش رسم کرده...
<br>
در قالب یک برنامه منعطف و حساب شده!
<br>
برای رشد تراز همه کنکوری ها در هر شرایطی!
<br>
پس برای شروع این سفر به هیچی لازم نداری جز یک چیز!! پاسخ این سوال!
<br>
آیا دوست داری برای رسیدن به هدفت تلاش کنی؟!چقدر؟!
',
            ],
            [
                'title' => ' اگر راه ابریشم داشته باشم؛ نیاز به منبع آموزشی دیگه‌ای هم دارم؟',
                'body' => 'وقتی داریم درباره ی یک مسیر صحبت میکنیم یا بهتره بگیم، یک برنامه هدفگذاری شده؛ کاملا واضح است که ابزار لازم رو در کنارش داریم! مگرنه مسیری که پر از چاله باشه، ما رو در این رقابت با زمان از هدفمون دور میکنه!!
<br>
هر فرسنگ راه ابریشم یک بخش یادگیری و ادراک داره به همراه حل مثال های مفهومی لابه لای تدریس مباحث تا همراه استاد با آمادگی ذهنی کامل بری سراغ تسلط روی تست ها!😉
<br>
تو سوال قبلی هم بهت گفتم! تو این مسیر لازم نیست هیچی با خودت برداری! همه چی آمادست .
آلاء فکر همه جاشو کرده و شما فقط با تمرکز کافی، تعهد به تلاش و از همه مهم‌تر، با خیالی راحت وارد مسیر شو!',
            ],
            [
                'title' => 'راه ابریشم بصورت پک فیزیکی ارسال میشه یا یک دوره آنلاینه؟',
                'body' => 'خوشبختانه راه ابریشم مسیریه که شما در هر نقطه جغرافیایی این کره خاکی که حضور داشته باشی؛ میتونی از همونجا سفرتو شروع کنی!
<br>
محتویات این برنامه ی هدفگذاری شده برای دسترسی راحت‌تر و سریع‌تر -با توجه به محدودیت های زمانی ای که یک داوطلب کنکور داره- فقط در سایت آلاء، به صورت مجازی و با ترتیبی که اعلام میشه هفته به هفته تو پروفایلتون منتشر خواهد شد و شما میتونین اون رو دانلود کنین...
<br>
یعنی دسترسی به این برنامه فقط با چند تا کلیک ساده اتفاق میفته و لازم نیست برای حضور در مکانی خاص انرژی صرف بشه...
<br>
یک مزیت دیگه این هست که اگر در مبحثی تمرکز کافی رو به کار نگرفتین، میتونین مجدد محتوای مربوط به اون مبحث رو تماشا کنین تا یادگیری‌تون فرایند کامل شدنش رو طی کنه ...',
            ],
            [
                'title' => 'برنامه راهبردی راه ابریشم آلاء، با برنامه آزمون های دوره‌ای ما مطابقت داره؟',
                'body' => 'برنامه راهبردی راه ابریشم آلاء، بسیار دقیق و منسجم تا روز کنکور چیده شده و تا رسیدن به هدفت یعنی موفقیت در آزمون سراسری میتونی بهش تکیه کنی .
<br>
بطور معمول تمام آزمون ها از منظر بودجه بندی، هم پوشانی بالایی دارند و شما در راه ابریشم نیز می‌توانید تا حدود زیادی به بودجه بندی آزمون های دوره‌ای خودتون هم برسید .
<br>
فرسنگ های راه ابریشم سه هفته‌ای است و مطابقت بالایی با آزمون گزینه دو خواهد داشت .
<br>
پیش آزمون و پس آزمون قلمچی و گزینه دو، از جذاب‌ترین اتفاقات راه ابریشم به حساب میاد .',
            ],
            [
                'title' => 'آیا آموزش آنلاین، جایگزین آموزش حضوری خواهد بود؟',
                'body' => 'امروزه، بلعکس این سوال صحیح است.
<br>
آموزش آنلاین ویژگی ها و قابلیت هایی رو خواهد داشت که اجرایی شدن این‌ها در شیوه حضوری حتی امکان‌پذیر نیست یا بسیار گران و دشوار است .
<br>
آموزش آنلاین به خودی خود هیجان‌انگیز است خصوصا اگر زیرنظر آلاء باشه .
<br>
این رو آلایی ها نازنین به خوبی درک میکنند .',
            ],
            [
                'title' => ' درمورد برنامه هدفمند راه ابریشم بیشتر توضیح میدید؟ ',
                'body' => 'این نکته حائز اهمیت است ...
<br>
راه ابریشم، مسیری است که آلاء طراحی کرده تا شما رو از مبدا (وضعیت فعلی) به مقصد (هدف شما) برسونه!
 و قبلا هم صحبت کردیم که چنین مسیری حتما باید یک نقشه داشته باشه تا در نهایت راحت و بدون دردسر و بدون هدر دادن زمان به مقصدمون برسیم...
 <br>
 پس چیزی که در این راه خیلی مهمه و آلاء هم روی اون تاکید داره؛ این هست که مطابق این نقشه که مدت ها برای طراحی‌اش تحقیق و آزمایش انجام شده، گام به گام مسیر رو طی کنیم .
 <br>
 در بازه های سه هفته‌ای راه ابریشم (فرسنگ) با مراحل ادراک، تثبیت، تسلط، ارزیابی و جمع‌بندی کنار هم هستیم تا دغدغه اصلی هممون در بازه های زمانی مختلف سال، مشترک باشه و خیلی زود خودمون رو به اون سطحی که باید باشیم برسونیم .',
            ],
            [
                'title' => 'تا چه زمانی می‌تونم از فیلم ها و جزوات دوره استفاده کنم؟ محدودیتی دارم؟',
                'body' => ' نگران نباش چون، هر زمان که ثبت نام کنی تا هرزمان که تمایل داشتی میتونی از محتوا و برنامه این دوره استفاده کنی . یه منبع آموزشی همیشه در دسترس.
<br>
این دوره برای استفاده شخص شما طراحی شده و استفاده اشتراکی با سایر دوستان به هیچ عنوان صحیح نیست و آلاء رضایت ندارد .',
            ],
            [
                'title' => 'استفاده اشتراکی با سایر دوستان از این دوره صحیح است؟ آلاء رضایت داره؟',
                'body' => ' تمام منافع مادی دوره های غیررایگان آلاء تماما صرف نگه‌داری هزاران ساعت محتوای رایگان آلاء، توسعه هرچه بیشتر امکانات رایگان و  هزینه های بسیار بالای مجموعه آلاء خواهد شد؛ درنتیجه اشتراکی خرید کردن، دریافت رایگان محتوای غیررایگان آلاء از سایر کانال ها و هرنوع استفاده غیرقانونی از این محصولات شرعا، قانونا و اخلاقا صحیح نیست و مجموعه آلاء به هیچ عنوان رضایت نخواهد داشت .',
            ],
            [
                'title' => 'انتشار یا دریافت این محصول چگونه است؟',
                'body' => 'این محصول به تدریج و در بازه های 3 هفته ای منتشر می شود',
            ],
        ];

        $banners = [
//            [
//                'url' => 'https://alaatv.com/',
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'url' => false,
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ],
//            [
//                'src' => 'https://nodes.alaatv.com/upload/images/slideShow/ad_abrisham_1401_20210726144636.jpg?w=541&h=253'
//            ]
        ];

        $APIAddresses = [
            'studyEventStudyPlan' => '/api/v2/studyEvent/8/studyPlans',
            'liveDescription' => '/api/v2/livedescription?created_at_since=2022-07-09&order_by[]=created_at&order_type[]=desc',
            'pinnedLiveDescription' => '/api/v2/livedescription/getPined',
            'seenLiveDescription' => '/api/v2/livedescription',
            'consultingContents' => '/api/v2/set/2224/contents',
            'whereIsKarvan' => '/api/v2/abrisham/whereIsKarvan?studyevent=8',
            'abrishamLessons' => '/api/v2/chatreNejat/lessons',
            'abrishamMajors' => '/api/v2/chatreNejat/majors',
        ];
        return response()->json([
            'user' => $user,
            'chatreNejatProducts' => $chatreNejatProducts,
            'liveDescription' => $liveDescription,
            'faq' => $faq,
            'banners' => $banners,
            'APIAddresses' => $APIAddresses
        ], 200);

    }
}