<?php

namespace App\Http\Controllers\Api;

use App\Http\Controllers\Controller;
use App\Models\Websitesetting;
use Illuminate\Http\Request;

class RulesPageController extends Controller
{
    private $setting;

    public function __construct(Websitesetting $setting)
    {
        $this->setting = $setting->setting;
    }

    public function __invoke(Request $request)
    {
        return response()->json([
            'data' => [
                0 => [
                    'rule' => 'کلیه اصول و رویه های آلاء ، منطبق با قوانین جمهوری اسلامی ، قانون تجارت الکترونیک و قانون حمایت از مصرف کننده است.',
                ],
                1 => [
                    'rule' => 'کلیه محتوای سایت صرفا متعلق به مجموعه ی آلاء می باشد و هرگونه کپی برداری و استفاده شخصی یا تجاری از آن پی گرد قانونی دارد.',
                ],
                2 => [
                    'rule' => 'مجموعه هر زمان اختیار دارد نسبت به اضافه کردن، تعویض یا حذف خدمات سایت اقدام کند.',
                ],
                3 => [
                    'rule' => 'تنها راه ارتباط با مجموعه آلاء به جز وب سایت، تماس با شماره های مندرج در صفحه ی تماس با مای سایت می باشد.',
                ],
                4 => [
                    'rule' => 'اگر از پی گیری مسئولین آلاء راضی نیستید می توانید شکایت خود را به ایمیل foratmail [at] gmail [dot] com ارسال کنید.',
                ],
                5 => [
                    'rule' => 'پس از خرید محصولات دانلودی امکان تغییر یا لغو کردن سفارش وجود ندارد و سفارش قابل عودت نمی باشد',
                ],
                6 => [
                    'rule' => 'استفاده گروهی و یا انتشار محصولات آلاء شرعا حرام و از نظر اخلاقی غیر مجاز می باشد.',
                ],
                7 => [
                    'rule' => 'آلاء خود را امین اطلاعات کاربران می داند و از آنها برای انجام هیچ پردازشی چه توسط خود و چه توسط سازمان های همکار استفاده نمی کند.',
                ]
            ],
        ]);
    }
}
