<?php
/**
 * Created by PhpStorm.
 * User: sohrab
 * Date: 2018-08-27
 * Time: 18:02
 */

return [
    'Educational Content Of Alaa' => 'محتوای آموزشی آلاء',
    'File Removed Successful' => 'فایل محتوا با موفقیت حذف شد',
    'show' => 'نمایش',
    'javascript is disables! we need it to play a video' => 'جهت پخش آنلاین فیلم، ابتدا مطمئن شوید که جاوا اسکریپت در مرور
                                        گر شما فعال است و از آخرین نسخه ی مرورگر استفاده می کنید.',


    'No previous content found' => 'محتوایی برای کپی یافت نشد ، برای استفاده از این پنل باید ابتدا یک محتوا برای این دوره درج کنید',
    'Not Free' => 'این فایل یک محصول است و با خرید یکی از محصولات زیر می توانید استفاده کنید.',
    'Not Free And you can\'t buy it' => 'این فایل برای محصولی بوده است که دیگر قابل خرید نیست و تنها عزیزانی که در گذشته محصول را خریداری کرده بودند، می توانند دانلود کنند.',
];
